Repository: JonathanRazorEc/SIGEMAD
Catalog: ProyectoSIGEMAD/DGPCE.Sigemad/DGPCE.Sigemad.Application/Resources/ValidationMessages.*.resx
Languages: es

# TerritorioObligatorio
source: The territory is mandatory
es: El territorio es obligatorio

# TerritorioInvalido
source: The territory is invalid
es: El territorio es inválido

# DenominacionNoVacio
source: Designation cannot be blank
es: Denominacion no puede estar en blanco

# DenominacionObligatorio
source: Designation is mandatory
es: Denominacion es obligatorio

# DenominacionMaxLength
source: Designation cannot exceed 255 characters
es: Denominacion no puede exceder los 255 caracteres

# FechaInicioObligatorio
source: Start date is mandatory
es: Fecha de Inicio es obligatoria

# ClaseSucesoObligatorio
source: Event Class is mandatory
es: Clase de Suceso es obligatorio

# EstadoSucesoObligatorio
source: Success Status is mandatory
es: Estado de Suceso es obligatorio

# GeoPosicionObligatorio
source: GeoPositioning is mandatory
es: GeoPosicion es obligatorio

# GeoPosicionInvalida
source: Geometry is invalid, reference system is not Wgs84
es: La geometría no es válida, sistema de referencia no es Wgs84

# ProvinciaObligatorio
source: Province is mandatory
es: Provincia es obligatoria

# ProvinciaInvalido
source: Province is invalid
es: Provincia es inválido

# MunicipioObligatorio
source: Municipality is mandatory
es: Municipio es obligatorio

# MunicipioInvalido
source: Municipality is invalid
es: Municipio es inválido

# PaisObligatorio
source: Pais is mandatory
es: Pais es obligatoria

# PaisInvalido
source: Pais is invalid
es: Pais es inválido

# UbicacionObligatorio
source: Location is mandatory
es: Ubicación es obligatorio

# UbicacionNoVacio
source: Location cannot be empty
es: Ubicación no puede ser vacio

# IdObligatorio
source: Id is mandatory
es: Id es obligatorio

# IdNoVacio
source: Id cannot be empty
es: Id no puede ser vacio

# EvolucionObligatorio
source: Evolution is mandatory
es: Evolucion es obligatorio

# FechaHoraObligatorio
source: DateHour is mandatory
es: FechaHora es obligatorio

# EntidadMenorObligatorio
source: Minor Entity is mandatory
es: Entidad Menor es obligatorio

# IncendioObligatorio
source: Fire is mandatory
es: Incendio es obligatorio

# IncendioInvalido
source: Fire is invalid
es: Incendio es invalido

# TipoDireccionEmergenciaObligatorio
source: Emergency address type is mandatory
es: Tipo dirección emergencia es obligatorio

# TipoDireccionEmergenciaInvalido
source: Emergency address type is invalid
es: Tipo dirección emergencia es invalido

# MunicipioCECOPIInvalido
source: Municipality CECOPI is invalid
es: Municipio CECOPI es invalido

# MunicipioCECOPIObligatorio
source: Municipality CECOPI is mandatory
es: Municipio CECOPI es Obligatorio

# MunicipioPMAiInvalido
source: Municipality PMA is invalid
es: Municipio CECOPI es invalido

# MunicipioPMAObligatorio
source: Municipality PMA is mandatory
es: Municipio PMA es Obligatorio

# ProvinciaPMAInvalido
source: Province PMA es invalido
es: Provincia PMA es invalido

# ProvinciaPMAObligatorio
source: Province PMA is invalido
es: Provincia PMA es obligatorio

# ProvinciaCECOPIInvalido
source: Province CECOPI es invalid
es: Provincia CECOPI es invalido

# ProvinciaCECOPIObligatorio
source: Province CECOPI es mandatory
es: Provincia CECOPI es obligatorio

# GeoPosicionPMAInvalida
source: PMA Geometry is invalid, reference system is not Wgs84
es: La geometría PMA no es válida, sistema de referencia no es Wgs84

# GeoPosicionPMAObligatoria
source: GeoPosicion PMA is mandatory
es: GeoPosicion PMA es obligatorio

# GeoPosicionCECOPInvalida
source: CECOPI Geometry is invalid, reference system is not Wgs84
es: La geometría CECOPI no es válida, sistema de referencia no es Wgs84

# GeoPosicionCECOPIObligatoria
source: CECOPI GeoPositioning is mandatory
es: GeoPosicion CECOPI es obligatoria

# AutoridadQueDirigeObligatorio
source: Directing Authority is mandatory
es: Autoridad que dirige es obligatorio

# AutoridadQueDirigeEnBlanco
source: Directing authority cannot be blank
es: Autoridad que dirige no puede estar en blanco

# FechaInicioPMAObligatorio
source: PMA Start date is mandatory
es: Fecha inicio PMA es obligatoria

# IncendioIdNoVacio
source: Id Incendio cannot be empty
es: Id Incendio no puede estar vacio

# IncendioIdObligatorio
source: IdIncendio is mandatory
es: IdIncendio es obligatorio

# MedioIdNoVacio
source: MedioId cannot be empty
es: MedioId no puede ser vacio

# MedioIdObligatorio
source: MedioId is mandatory
es: MedioId es obligatorio

# FechaHoraNoVacio
source: DateHour cannot be empty
es: FechaHora no puede ser vacio

# AsuntoNoVacio
source: Subjetc cannot be empty
es: Asunto no puede ser vacio

# AsuntoNoNulo
source: Subjet is mandatory
es: Asunto es obligatorio

# AsuntoMaxLegth
source: Subject cannot exceed 500 characters
es: Asunto no puede superar 500 caracteres

# IdSucesoAsociadoNoVacio
source: Associated Event Id cannot be empty
es: Id Suceso asociado no puede ser vacio

# IdSucesoAsociadoObligatorio
source: Associated Event Id is mandatory
es: Id suceso asociado es oblogatorio

# IdSucesoPrincipalNoVacio
source: Main Event Id cannot be empty
es: Id Suceso principal no puede ser vacio

# IdSucesoPrincipalObligatorio
source: Main Event Id is mandatory
es: Id Suceso principal es obligatorio

# AreaAfectadaNoNulo
source: The list of affected areas cannot be zero.
es: La lista de áreas afectadas no puede ser nula.

# AreaAfectadaVacio
source: The list of affected areas cannot be empty.
es: La lista de áreas afectadas no puede estar vacía.

# IdTipoDireccionEmergenciaInvalido
source: Id Emergency Address Type is invalid
es: Id Tipo de Direccion Emergencia es inválido

# FechaInicioDebeSerMenorQueFechaFin
source: Start Date must be less than End Date
es: Fecha de Inicio debe ser menor que Fecha Fin

# LugarObligatorio
source: The location is mandatory
es: El lugar es obligatorio

# DireccionesObligatorio
source: Address list is mandatory
es: Las lista de direcciones es obligatorio

# CoordinacionesObligatorio
source: The coordination list is mandatory
es: La lista de coordinaciones es obligatorio

# FechaHoraSolicitudObligatorio
source: DateTimeRequest is Mandatory
es: FechaHoraSolicitud es obligatoria

# IdTipoDocumentoObligatorio
source: IdDocumentType is mandatory
es: IdTipoDocumento es obligatorio

# IdTipoDocumentoInvalido
source: IdDocumentType is invalid
es: IdTipoDocumento es invalido

# DescripcionObligatorio
source: Description is mandatory
es: Descripción es obligatorio

# DescripcionMaxLength
source: Description cannot exceed 255 characters
es: Descripción no puede exceder los 255 caracteres

# IdArchivoObligatorio
source: IdFile is mandatory
es: IdArchivo es obligatorio

# ListaOtraInformacion
source: Lista de Otra información es obligatorio
es: List of Other information is required

# ObservacionObligatorio
source: Note is mandatory
es: Observación es obligatorio

# IdSucesoObligatorio
source: Id Event is mandatory
es: Id Suceso es obligatorio

# RegistroObligatorio
source: Record Data is mandatory
es: Datos de Registros son obligatorio

# DatoPrincipalObligatorio
source: Main data are mandatory
es: Datos Principal son obligatorios

# ParametroObligatorio
source: Parameter data are mandatory
es: Datos de parámetros son obligatorio

# IdEntradaSalidaObligatorio
source: Input/Output list ID is mandatory
es: Id de lista Entrada/Salida es obligatorio

# IdMedioObligatorio
source: Media list ID is required
es: Id de lista de medios es obligatorio

# ProcedenciasDestinosObligatorio
source: Source/Destination list is required
es: Lista de procedencia/Destino es obligatorio

# IdEstadoIncendioObligatorio
source: State Fire ID is mandatory
es: Id de estado incendio es obligatorio

# AutoridadSolicitanteObligatorio
source: Requesting Authority is mandatory
es: Autoridad Solicitante es obligatorio

# AutoridadSolicitanteMaxLength
source: Requesting Authority cannot exceed 500 characters
es: Autoridad solicitante no puede superar los 510 caracteres

# DescripcionSolicitudObligatorio
source: Application Description is mandatory
es: Descripción Solicitud es obligatorio

# DescripcionSolicitudMaxLength
source: Application Description cannot exceed 510 characters
es: Descripción Solicitud no puede superar los 510 caracteres

# FechaSolicitudObligatorio
source: DateRequest is Mandatory
es: FechaSolicitud es obligatoria

# DenominacionZAGEPMaxLength
source: Designation cannot exceed 510 characters
es: Denominación no puede exceder los 510 caracteres

# AutoridadObligatorio
source: Authority is mandatory
es: Autoridad es obligatorio

# AutoridadMaxLength
source: Authority cannot exceed 100 characters
es: Autoridad no puede exceder 100 caracteres

# LugarObligatorioMaxLength
source: The location cannot exceed 510 characters
es: Lugar no puede exceder los 510 caracteres

# ConvocadosObligatorio
source: Summoned is mandatory
es: Convocados es obligatorio

# ConvocadosMaxLength
source: Summoned cannot exceed 510 characters
es: Convocados no puede exceder los 510 caracteres

# IdArchivoOrArchivo
source: You must provide at least one value for FileID or Archive
es: Debe proporcionar al menos un valor para IdArchivo o Archivo

# IdTipoSistemaEmergencia
source: Emergency System Type ID is mandatory
es: Id Tipo Sistema de Emergencia es obligatorio

# IdTipoNotificacionObligatorio
source: IdNotificationType is mandatory
es: IdTipoNotificacion es obligatorio

# FechaHoraNotificacionObligatorio
source: DateTimeNotification is mandatory
es: FechaHoraNotificacion es obligatorio

# OrganosNotificadosObligatorio
source: Notified Bodies is mandatory
es: Organos Notificados es obligatorio

# OrganosNotificadosMaxLength
source: Notified bodies may not exceed 510 characters in length.
es: Organos notificados no puede superar los 510 caracteres

# FechaInicioFutura
source: The start date cannot be later than the current date.
es: La fecha de inicio no puede ser posterior a la fecha actual.

# ObservacionesObligatorio
source: Comments is mandatory
es: Observaciones es obligatorio

# PrevisionObligatorio
source: PrevisionObligatorio es obligatorio
es: Forecasting is mandatory

# FechaHoraActualizacionObligatorio
source: DateTimeUpdate is mandatory
es: FechaHoraActualizacion es obligatorio

# IdCapacidadObligatorio
source: IdCapacity is mandatory
es: IdCapacidad es obligatorio

# IdCaracterMedioObligatorio
source: IdAverageCharacter is mandatory
es: IdCaracterMedio es obligatorio

# NumeroCapacidadesObligatorio
source: NumberCapacities is mandatory
es: NumeroCapacidades es obligatorio

# IdTitularidadMedioObligatorio
source: IdOwnershipMedium
es: IdTitularidadMedio es obligatorio

# FechaHoraActivacionObligatorio
source: DateTimeActivationMandatory is mandatory
es: FechaHoraActivacionObligatorio es obligatorio

# CodigoMaxLength
source: Code cannot be longer than 15 characters
es: Codigo no puede tener mas de 15 caracteres
